Бух_для_edt/src/Catalogs/смартПредопределенныеЗначения/смартПредопределенныеЗначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартПредопределенныеЗначения</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПодключенияHTTP</name>
      <description>Подключения HTTP</description>
    </items>
    <items>
      <name>АдресДляОтправкиПакетаНаСкладАдмирал</name>
      <description>Адрес для отправки пакета на склад Адмирал</description>
    </items>
    <items>
      <name>АтлантFTPАдрес</name>
      <description>Атлант FTPАдрес</description>
    </items>
    <items>
      <name>АтлантFTPЛогин</name>
      <description>Атлант FTPЛогин</description>
    </items>
    <items>
      <name>АтлантFTPПароль</name>
      <description>Атлант FTPПароль</description>
    </items>
    <items>
      <name>ДатаНачалаКонтроляОтгрузкиМаркированнойПродукции</name>
      <description>Дата начала контроля отгрузки маркированной продукции</description>
    </items>
    <items>
      <name>ДатаНачалаОбменаДокументамиСУТЧерезУниверсальныйФормат</name>
      <description>Дата начала обмена документами с УТ через универсальный формат</description>
    </items>
    <items>
      <name>КаталогСкладаАдмирал</name>
      <description>Каталог склада Адмирал</description>
    </items>
    <items>
      <name>КоличествоПопытокОтправкиУведомлений</name>
      <description>Количество попыток отправки уведомлений</description>
    </items>
    <items>
      <name>ПапкаФайловВложенийУведомлений</name>
      <description>Папка файлов вложений уведомлений</description>
    </items>
    <items>
      <name>ПодразделениеСинхронизации</name>
      <description>Подразделение синхронизации</description>
    </items>
    <items>
      <name>РабочаяБазаБП</name>
      <description>Рабочая база БП</description>
    </items>
    <items>
      <name>РабочийСервер</name>
      <description>Рабочий сервер</description>
    </items>
    <items>
      <name>СкладАдмирал</name>
      <description>Склад Адмирал</description>
    </items>
    <items>
      <name>СкладОсновной</name>
      <description>Склад основной</description>
    </items>
    <items>
      <name>СкладыСписанияТоваров</name>
      <description>Склады списания товаров</description>
    </items>
    <items>
      <name>СтатьяЗатратПоГарантийнымЗапчастям</name>
      <description>Статья затрат по гарантийным запчастям</description>
    </items>
  </predefined>
  <attributes>
    <name>СписокЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТЧСписокЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Значения</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>BusinessProcessRef</types>
        <types>DocumentRef</types>
        <types>TaskRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСписокЗначений</name>
    <attributes>
      <name>к1</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>BusinessProcessRef</types>
        <types>DocumentRef</types>
        <types>TaskRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>к2</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>BusinessProcessRef</types>
        <types>DocumentRef</types>
        <types>TaskRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>к3</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>BusinessProcessRef</types>
        <types>DocumentRef</types>
        <types>TaskRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>к4</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>BusinessProcessRef</types>
        <types>DocumentRef</types>
        <types>TaskRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Бух_для_edt/src/Catalogs/смартПредопределенныеЗначения/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
	Если Объект.СписокЗначений Тогда
		
		Если ЗначениеЗаполнено(Объект.Значение) Тогда
			НоваяСтрока = Объект.Значения.Добавить();
			НоваяСтрока.Значение = Объект.Значение;
			Объект.Значение = Неопределено;
		КонецЕсли;
		
	Иначе
		Если Объект.Значения.Количество() > 0 Тогда
			Объект.Значение = Объект.Значения[0].Значение;
			Объект.Значения.Очистить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьДоступность()
    Если Объект.СписокЗначений Тогда
        Элементы.Значение.Видимость=Ложь;
        Элементы.Значения.Видимость=Истина;      
        Элементы.ИспользоватьТЧСписокЗначений.Видимость=Ложь;
        Элементы.ТЧСписокЗначений.Видимость=Ложь; 
    ИначеЕсли Объект.ИспользоватьТЧСписокЗначений Тогда    
        Элементы.Значение.Видимость=Ложь;
        Элементы.Значения.Видимость=Ложь;      
        Элементы.СписокЗначений.Видимость=Ложь;
        Элементы.ТЧСписокЗначений.Видимость=Истина; 
    Иначе
        Элементы.Значение.Видимость = Истина;  
        Элементы.Значения.Видимость=Ложь;
        Элементы.СписокЗначений.Видимость=Истина;
        Элементы.ИспользоватьТЧСписокЗначений.Видимость=Истина;
        Элементы.ТЧСписокЗначений.Видимость=Ложь; 
    КонецЕсли;
    //Элементы.Значение.Видимость = НЕ Объект.СписокЗначений;
    //Элементы.Значения.Видимость = Объект.СписокЗначений;  

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТЧСписокЗначенийПриИзменении(Элемент)
    ИспользоватьТЧСписокЗначенийПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИспользоватьТЧСписокЗначенийПриИзмененииНаСервере()
      НастроитьВидимостьДоступность();
КонецПроцедуры
